module.exports.приставка = ["Конче", "Кило", "Электро", "Хуе", "Дебило", "Залупо", "Кало", "Ультра", "Ебло", "Говно", "Изо", "Шлюхо", "Жиро", "Мега", "Микро", "Нано",
"Руко", "Недо", "Спино", "Свино", "Эко", "Гомо", "Хуе", "Пиздо", "Гипер", "Кибер", "Лже", "Мили", "Мини", "Пидоро", "Тупо", "Золо", "Гидро", "Жопо", "Мыло", "Члено", "Зомби", "Криво", "Уебо", "Сили", "Херо", "Эндо", "Гео", "Био", "Дебило", "Говно", "Супер", "Гекта", "Тера", "Суче", "Очко", "Пенисо", "Хим", "Копро", "Педо", "Термо", "Гетеро", "Анти", "Мудо", "Грибо", "Водо", "Крысо", "Хрено", "Крысо", "Гипно"];
module.exports.слово = ["липут", "пенис", "хуй", "карась", "понос", "перхоть", "шлюха", "угольник", "тозоид", "демон", "блядь", "гусь", "жоп", "хол", "дрочун",
"блуд", "лох", "завр", "жир", "хвост", "дрочер", "петух", "залупа", "грыз", "сос", "дверь", "анус", "питек", "холоп", "конча", "гном",
"гей", "пердун", "карлик", "лёт", "ед", "лёд", "пизда",
"глот", "чмо", "дорас", "сука", "щука", "лось",
"носок", "жуй", "мразь", "гниль",
"хуйло", "елда", "уебан", "проститутка", "бариген", "прыщ", "пидор", "моча", "дрыщ", "матозоид", "сосатель", "тухлятина", "дыр",
"трах", "свин", "голубь", "хрен", "даун", "мусор", "глист", "глиста", "шизик", "урод", "зомби", "сперм", "гной", "оксид", "ксид", "обариген", "еблан", "отсос", "лоб", "лиз", "фузория", "мусор", "помойка", "лис", "хер", "стрел", "род", "хлоп", "пендос", "врей", "оксидант", "колон", "член", "рез", "хлоп", "нос", "вод", "привод", "воз", "фил", "фоб", "мяч", "швайн", "примат", "макака", "шпрот", "голов", "кат", "кариот", "атом", "завр", "ёб", "шлёп", "труп", "таракан", "ток", "пук", "фабрикат", "колог", "жмот"];

module.exports.второеСлово1 = ["обрыганный", "поршивый", "конченный", "сибирский", "пустынный", "адский", "подзалупный", "гнилый", "тухлый", "стухвший", "страшный",
"дикий", "свиной", "вонючий", "уебищный", "ебанутый", "сопливый", "слюнявый", "бессовестный", "карликовый", "безмозговый",
"ушатаный", "позорный", "уродливый",
"куриный", "гнилой", "продыряванный", "дырявый", "трусливый", "помойный", "стиральный", "мокрый", "хуевый", "клоунский", "безгендерный", "посудомоечный", "одноразовый", "дрочененный", "помойный", "резаный", "ибанутый", "сосущий", "липкий", "пиздолизущий", "лизущий", "щитаный", "надроченный", "напыщнный", "бесполый", "жирный", "безмозглый", "бутербродный", "надристанный", "протараненный", "алкогольный", "похмельный", "интимный", "лесной", "мясный", "мусорный", "девичий", "подкаблучный", "простой", "одноклеточный", "однодольный", "двудольный", "экзаменационный", "бетонный", "квадратный", "изношенный", "поношенный", "использованный", "безалкогольный", "некотиновый", "импотенточный", "примитивный", "разумный"];
module.exports.второеСлово2 = ["обрыганная", "поршивая", "конченная", "сибирская", "пустынная", "адская", "подзалупная", "гнилая", "тухлая", "стухвшая", "страшная",
"дикая", "свиная", "вонючая", "уебищная", "ебанутая", "сопливая", "слюнявая", "бессовестная", "карликовая", "безмозговая",
"ушатаная", "позорная", "уродливая",
"куриная", "заказная", "продыряванная", "дырявая", "трусливая", "помойная", "стиральная", "мокрая", "хуевая", "клоунская", "безгендерная", "посудомоечная", "одноразовая", "дроченная", "помойная", "резаная", "ибанутая", "сосущая", "липкая", "пиздолизущая", "лизущая", "щитаная", "надрочннная", "напыщенная", "бесполая", "жирная", "безмозглая", "бутербродная", "надристанная", "протараненная", "алкогольная", "похмельная", "интимная", "лесная", "мясная", "мусорная", "девичая", "подкаблучная", "простая", "одноклеточная", "однодольная", "двудольная", "экзаменационная", "бетонная", "квадратная", "изношенная", "поношенная", "использованная", "импотенточная", "примитивная", "разумная"];
// второеСлово1 - мужской род
// второеСлово2 - женский род



module.exports.род = function (слово) {
    const мужскойОкончания = ["", "н", "р", "й", "в"];
    const женскийОкончания = ["а", "я", "ь", "и"];

    const последняяБуква = слово.charAt(слово.length - 1);
    
    if (мужскойОкончания.includes(последняяБуква)) {
        return 0; // Мужской род
    } else if (женскийОкончания.includes(последняяБуква)) {
        return 1; // Женский род
    } else {
        return -1; // Неопределенный
    }
};